# 航空公司代码到名称的映射
AIRLINE_NAMES = {
    "CA": "中国国际航空",
    "MU": "中国东方航空", 
    "CZ": "中国南方航空",
    "HU": "海南航空",
    "3U": "四川航空",
    "SC": "山东航空",
    "MF": "厦门航空",
    "ZH": "深圳航空",
    "EU": "成都航空",
    "8L": "祥鹏航空",
    "KY": "昆明航空",
    "PN": "西部航空",
    "JR": "幸福航空",
    "RY": "江西航空",
    "GJ": "长龙航空",
    "9H": "长安航空",
    "UQ": "乌鲁木齐航空",
    "GS": "天津航空",
    "TV": "西藏航空",
    "JD": "首都航空",
    "DR": "桂林航空",
    "A6": "红土航空",
    "G5": "华夏航空",
    "HO": "吉祥航空",
    "FM": "上海航空",
    "BK": "奥凯航空",
    "DZ": "东海航空",
    "NS": "河北航空",
    "QW": "青岛航空",
    "FU": "福州航空",
    "GX": "北部湾航空",
    "LT": "龙江航空",
    "OQ": "重庆航空",
    "GY": "多彩贵州"
}

def get_airline_name(code):
    """获取航空公司名称"""
    return AIRLINE_NAMES.get(code, code)
